[
  {
    "id": "S-01",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "PRESS ENTER TO START"
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-02",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ]
  },
  {
    "id": "S-02",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "The United League of Worlds (ULW) is an alliance of planetary systems.  The individual systems are semi-autonomous entities under a central government.  The member worlds of the ULW agree to a basic set of principles.  They are bound together as equal partners for mutual defense, to share knowledge and resources, and to cooperate in scientific study and exploration.",
      "You are a ULW commander aboard the intergalactic star ship Pegasus.  Your mission as you travel from system to system is to seek out and understand life as it exists in the universe.  When you interact with the worlds you meet, you are to assist where you can and represent the ULW proudly with the highest of ethical standards in hopes that these new worlds will respect the League and consider joining.",
      "The path ahead is difficult but rewarding.  Good luck to you in your travels."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-03",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ]
  },
  {
    "id": "S-03",
    "role": "variable",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "What is your name"
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-04",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "variableName": "PLAYER_NAME",
    "variableRx": "^[^\\s]{1}.{0,9}$",
    "variableErrMsg": "Must be between 1 and 10 characters"
  },
  {
    "id": "S-04",
    "role": "cut scene",
    "bgColor": "#000000",
    "bgImage": "assets\\img\\Pegasus1.png",
    "fgColor": "white",
    "fgText": [
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "cutSceneShowMs": 2000
  },


  {
    "id": "S-10",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "The planet Lacaille is recovering from an 80-year war with a neighboring system.  They are desperate for energy and decide to tap the molten core of it’s second moon Erappa. The energy will be used to heat 300,000 homes for the upcoming winter.  Without it, many will suffer.",
      "Erappa is habitable, but very sparsely populated. The core tapping process will release poisonous gasses into the atmosphere making the moon unlivable for 10 years. The government of Lacaille has requested help from the League of Worlds to make a final inspection of Erappa to ensure everyone has been evacuated.",
      "You are given command of the mission.  During your inspection, you find an elderly man named Bok still on the moon. Bok fought in the war and escaped an enemy prison to settle on Erappa as its first inhabitant.  He understands what is happening, but refuses to evacuate saying that if he is forced to leave his home, he will die."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-11",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },
  {
    "id": "S-11",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You greatly respect the man for his tenacity and military service, but Lacaille and the League of Worlds are counting on you to clear the moon so the energy collection process can begin.",
      "What do you do?"
    ],
    "commands": [
      {
        "key": "1",
        "text": "Allow him to stay as he wishes and tell Lacaille to begin the energy tapping process.",
        "transitions": [
          {
            "stateId": "S-11.10",
            "chance": 1,
            "dPoints": -1,
            "uPoints": 1,
            "pPoints": 1,
            "ePoints": -1
          }
        ]
      },
      {
        "key": "2",
        "text": "Forcibly transport him off the moon to Lacaille for resettlement.",
        "transitions": [
          {
            "stateId": "S-11.21",
            "chance": 0.5,
            "dPoints": 1,
            "uPoints": 1,
            "pPoints": 1,
            "ePoints": -1
          },
          {
            "stateId": "S-11.22",
            "chance": 0.5,
            "dPoints": 1,
            "uPoints": 1,
            "pPoints": 1,
            "ePoints": 1
          }
        ]
      },
      {
        "key": "3",
        "text": "Instruct the Lacaillean government to hold off on starting the project until you can convince the last inhabitant to leave willingly.",
        "transitions": [
          {
            "stateId": "S-11.30",
            "chance": 0.5,
            "dPoints": 1,
            "uPoints": 0,
            "pPoints": -1,
            "ePoints": 1
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },
  {
    "id": "S-11.10",
    "role": "text",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "With tears in his eyes, Bok thanks you for letting him live life on his own terms.",
      "You inform the government of Lacaille that you have finished your inspection of Erappa and they are clear to begin tapping the moon’s core.  The League congratulates you on a job well done and the people of Lacaille celebrate as the new bounty of energy provides much needed life necessities to those most in need.",
      "You’re not sure long Bok survived, but the thought of him slowly suffocating alone deeply saddens you."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },
  {
    "id": "S-11.21",
    "role": "text",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You request security personnel from the local government to help you remove Bok from Erappa for resettlement on Lacaille. In a furious rage, Bok stabs 2 of the security offers with a farm implement.  A third officer shoots Bok with a blaster pistol before he can do any more damage.  Bok dies instantly.",
      "The League and government of Lacaille are satisfied with you handling of the matter, but you are saddened by the violent death of Bok."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },
  {
    "id": "S-11.22",
    "role": "text",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You request security personnel from the local government to help you remove Bok from Erappa for resettlement on Lacaille. In a furious rage, Bok stabs 2 of the security offers with a farm implement.",
      "The security officers eventually restrain Bok and drag him to the transport.  He screams curses at you the whole way there.",
      "The League and government of Lacaille are satisfied with you handling of the matter.",
      "Years later, after Bok becomes accustomed to his new life on Lacaille, he messages you and thanks you for saving his life."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },
  {
    "id": "S-11.30",
    "role": "text",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You instruct the Lacaillean government to hold off on starting the energy tapping process because there are still people on Erappa.  For 2 weeks you plead with Bok to leave with you to resettle on Lacaille.",
      "Twice, your command officer gives you a direct order to remove the last inhabitants from the planet so the project can begin.  You gently refuse continuing to plead with Bok to leave.  “As long as this farm still stands, I’m staying,” Bok says.",
      "In a final act of desperation, you set fire to his house.  Bok is furious, but then, seeing how hard you are working to save him, agrees to leave with you.  You relocate Bok to Lacaille and instruct the government to start their efforts to tap the moon’s core."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Deep Space Nine",
    "imdbId": "tt0708584"
  },


  {
    "id": "S-20",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "While surveying a nebula in the Korot system, the Pegasus collides with a small asteroid causing minor outer hull damage. A metal beam breaks off and falls on K’vosh, one of the senior officers inspecting the damaged area of the ship.  The accident leaves K’vosh paralyzed from the neck down.",
      "K’vosh is the only Groor officer in the League.  The Groor are a warrior race that prize physical prowess, battle skill, and personal honor above all else.  The Groor are relatively new members of the League and the alliance is still somewhat tentative.  They fear the League does not respect them as much as the other member races."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-21",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-21",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "The ship’s medical technology is impressive, but Dr. Joffo, the ships chief medical officer, fears the paralysis is permanent.  Dr. Joffo recommends cybernetic implants that, with practice, can give K’vosh about 70% of his normal mobility and allow him to live his life with minor assistance. The only other treatment option is to attempt a spinal graft.  The procedure could fully restore K’vosh’s mobility, but it is an experimental treatment never tried before and carries a significant risk of death.",
      "Upon learning of his condition, K’vosh is horribly distraught.  In accordance with Groor societal expectations and traditions, K’vosh pleads with you, his commander and friend, to help him perform the Bhak’gra, a ceremonial suicide ritual. In Groor society, it is the proper and honorable action given the circumstance.  Never before has a human been asked to assist in the Bhak’gra; it is a testament to the respect and friendship you have built with K’vosh.  To refuse the request would be an insult to K’vosh and possibly the entire Groor empire."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-22",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-22",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "K’vosh has asked you to help him perform the Bhak’gra but, out of an intense sense of duty, will follow whatever recommendation his commanding officer gives him.",
      "What do you do?"
    ],
    "commands": [
      {
        "key": "1",
        "text": "Help K’vosh perform the Bhak’gra as Groor tradition demands.",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-22.10",
            "dPoints": 1,
            "uPoints": 1,
            "pPoints": -1,
            "ePoints": -1
          }
        ]
      },
      {
        "key": "2",
        "text": "Refuse to help K’vosh end his life and recommend he get the medical implants.  It is safe and he can live a full life afterward.",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-22.20",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      },
      {
        "key": "3",
        "text": "Recommend the experimental spinal graft.  It is risky, but you fear K’vosh will never accept his handicap and will find someone else to help him commit suicide.",
        "transitions": [
          {
            "chance": 0.25,
            "stateId": "S-22.31",
            "dPoints": 1,
            "uPoints": 1,
            "pPoints": 1,
            "ePoints": 1
          },
          {
            "chance": 0.75,
            "stateId": "S-22.32",
            "dPoints": 1,
            "uPoints": 1,
            "pPoints": -0.5,
            "ePoints": -0.5
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-22.10",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "It is not an easy decision.  Even though it goes against your personal beliefs, you decide to help K’vosh perform the Bhak’gra because you want to honor your friend’s decision and you know how important Groor traditions are to him.  He would probably not forgive you if you refused to help and you suspect that he would never accept living with the implants.",
      "As you prepare to plunge the cerimonal knife into K’vosh’s chest, he thanks you as a brother for saving him form a life with dishonor.  The act saddens and horrifies you.  You doubt you will ever be the same man again.",
      "The Groor hear about the situation and are greatly pleased that the League has shown such respect for their customs."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-22.20",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You believe life is sacred.  It is not right for K’vosh to commit suicide and it is absolutely wrong for you to help him do it.  It’s so senseless.  With the medical implants and proper rehabilitation, K’vosh can live a full and productive life.",
      "When you tell K’vosh you will not help him with the Bhak’gra, you know from the look he gives you that he will never forgive you.  K’vosh request to be sent home where you suspect he will find someone else to help him end his life. The Groor are somewhat understanding of the differences between cultures, but are never the less disappointed by the way one of their fellow brethren was treated.",
      "You’re confident you made the right decision.  However, it is a long time before you sleep peacefully at night."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-22.31",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You understand and respect Groor customs, but you just can’t bring yourself to participate in the Bhak’gra.  The only chance you have to save your friend is to recommend the experimental spinal graft.  It’s very risky and may result in death, but you know if you do nothing, K’vosh will just find someone else to help him end his life.",
      "The procedure is long and difficult, but is ultimately successful.  K’vosh makes a full recovery.  The data collected during the procedure helps perfect the treatment and benefits many others.",
      "Dr. Joffo is happy that K’vosh is fully recovered, but he does not agree with your decision to recommend such a risky procedure.  He notes this in his report to the League."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },
  {
    "id": "S-22.32",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "It’s very risky and may result in death, but you know if you do nothing, K’vosh will just find someone else to help him end his life.",
      "Unfortunately, K’vosh does not survive the procedure. You return his body to the Groor home world and mourn the loss of a dear friend.",
      "Although the first attempt did not succeed, the data collected during the procedure significantly advances research of spinal injuries leading to new treatment options that benefit many others."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: The Next Generation",
    "imdbId": "tt0708709"
  },


  {
    "id": "S-30",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "While charting a remote and unexplored area of space, the Pegasus receives a strange transmission. You decide to follow that transmission and encounter a ship that appears to be in distress. The ship is of an unknown design and origin. Scans reveal a single lifeform with fading vital signs.",
      "You instruct the crew to transport the alien lifeform directly to the medical bay surrounded by a quarantine field. After inspection, Dr. Jaffo tells you that the alien is unlike anything ever recorded in ULW medical databases. He is unsure if there is anything he can do to help.",
      "As you are discussing the matter with the doctor, the alien’s ship explodes. There are no casualties on the Pegasus, but the ship has been heavily damaged. Structural integrity has been compromised and the fusion reactor is destabilizing. If repairs are not made soon, life support could fail and everyone on board will be lost. The nearest ULW ship is 3 months away at maximum speed. You may not have that much time."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-31",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-31",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "Mia Taylor, the ship’s chief engineer, comes to the medical bay to discuss repair priorities with you. Suddenly, the strange, insect-like alien leaps off the medical bed, somehow crosses the quarantine field, and attaches itself to Lieutenant Taylor. She is alive, but the doctor doesn’t think he can remove the parasitic alien from Lt. Taylor without killing both.",
      "Dr. Jaffo finds research documents in the ship’s database that helps him develop a procedure that will separate the alien and may save Lt. Taylor’s life. The research he used was conducted by an astrobiologist named Dr. Naris. Dr. Naris was brilliant, but notorious for brutal and horrific experiments on living subjects.",
      "Lt. Taylor learns that the monstrous Dr. Naris’s research was the basis for the procedure Dr. Jaffo intends to use on her. She adamantly refuses the treatment stating that to use the research would be to validate his methods and possibly encourage others to do so. She would rather die than let that happen."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "S-32",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "The doctor comes to you and ask for advice.  You are torn between Lt. Taylor’s right to refuse treatment and your fear that if the chief engineer dies, your team may not be able to keep the ship’s life support systems from failing.",
      "What do you do?"
    ],
    "commands": [
      {
        "key": "1",
        "text": "Tell the doctor to perform the procedure using Dr. Naris’s research.  Although you respect Lt. Taylor’s wishes, you are responsible for every life on the ship and losing your chief engineer is not a risk you can take at a time like this. You worry that your relationship with Lt. Taylor may not be the same after this.",
        "transitions": [
          {
            "stateId": "S-32.10",
            "chance": 1,
            "dPoints": -0.5,
            "uPoints": 0.5,
            "pPoints": 0,
            "ePoints": 0.25
          }
        ]
      },
      {
        "key": "2",
        "text": "It’s not a decision you agree with, but Lt. Taylor’s has a right to choose what is done to her own body. You’ll just have to do what you can with the remaining engineering staff.",
        "transitions": [
          {
            "stateId": "S-32.20",
            "chance": 1,
            "dPoints": 0.5,
            "uPoints": -0.5,
            "pPoints": 0,
            "ePoints": -0.25
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32.10",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "You instruct the doctor to start the separation procedure. Part of the procedure involves electro-static pulses to the alien’s nervous system to temporarily paralyze it. While performing the procedure, the alien’s vital signs start fluctuating wildly. Dr Jaffo says if he continues the procedure, the alien will die.  If he doesn’t finish the procedure, Lt. Taylor will die.  The doctor says that he can reduce the voltage of the pulses.  This will reduce the stress on the alien, but will take longer and may not be enough to fully detach the alien.  Additionally, Lt. Taylor’s vital signs are dropping fast. She may die before you finish the separation.",
      "What do you do?"
    ],
    "commands": [
      {
        "key": "1",
        "text": "Tell the doctor to continue the treatment.",
        "transitions": [
          {
            "stateId": "S-32.10.10",
            "chance": 1,
            "dPoints": -0.5,
            "uPoints": 0.5,
            "pPoints": -0.25,
            "ePoints": 0
          }
        ]
      },
      {
        "key": "2",
        "text": "Tell the doctor to continue with a lower voltage.",
        "transitions": [
          {
            "stateId": "S-32.10.20",
            "chance": 0.75,
            "dPoints": 0.5,
            "uPoints": -0.5,
            "pPoints": 0.5,
            "ePoints": 0.25
          },
          {
            "stateId": "S-32.10.21",
            "chance": 0.25,
            "dPoints": 0.5,
            "uPoints": -0.5,
            "pPoints": 0.5,
            "ePoints": 0.25
          }
        ]
      },
      {
        "key": "3",
        "text": "You’ve changed your mind.  Tell the doctor to abort to procedure and honor Lt. Taylor’s wishes to refuse treatment.",
        "transitions": [
          {
            "stateId": "S-32.20",
            "chance": 1,
            "dPoints": -1,
            "uPoints": -0.5,
            "pPoints": 0,
            "ePoints": -0.5
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32.10.10",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "Dr. Jaffo successfully separates the alien from Lt. Taylor.  Lt. Taylor is weak, but is able supervise repair of the ship without further incident.",
      "As the doctor fears, the alien dies. It was a difficult situation and you’re confident in your decision, but the ULW isn’t thrilled with your report. Subsequent contact with a species is much harder when first contact results in death."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": -0.25,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32.10.20",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "Both Lt. Taylor and the alien survive.  Lt. Taylor is weak, but is able supervise repair of the ship without further incident.",
      "You follow the alien ship’s engine signature back to its planet and return it home.  The alien race is unique and your crew has not yet been able to decipher their language, but you can tell the aliens are appreciative of your efforts.",
      "The ULW is excited about first contact with a new species.  They are appreciative of your efforts to keep the alien alive."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0.25,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32.10.21",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "Both Lt. Taylor and the alien survive.  However, Lt. Taylor is severely weakened by the procedure and is unable to supervise repair of the ship.",
      "The following day, a power relay in engineering erupts killing several crewmembers.  The remaining engineering staff is able to stabilize ships power and life support, but the ship has lost propulsion.  You have to wait 3 months for another ship to arrive with additional equipment to finish repairs.",
      "The ULW is excited to have first contact with a new and unique race.  They are appreciative of your efforts to keep the alien alive."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": -0.25,
            "ePoints": -0.25
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },
  {
    "id": "S-32.20",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "Lt. Taylor thanks you for respecting her wishes. Her vital signs continue to weaken over the next week until she finally passes.",
      "The remaining engineering crew is able to stabilize the ship and restore minimal propulsion. ",
      "You follow the alien ship’s engine signature back to its planet and return it home.  The alien is so weak, you are unsure if it will survive and you are unsure how the alien’s people view the situation."
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-STATE",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ],
    "imdbTitle": "Star Trek: Voyager",
    "imdbId": "tt0708939"
  },

  {
    "id": "S-990",
    "role": "command",
    "bgColor": "#000000",
    "fgColor": "white",
    "fgText": [
      "{{PLAYER_NAME}},",
      "   DEONTOLOGICAL ETHICS POINTS = {{d}}",
      "     UTILITARIAN ETHICS POINTS = {{d}}",
      "PROFESSIONAL REPUTATION POINTS = {{d}}",
      "   EMOTIONAL WELL-BEING POINTS = {{e}}"
    ],
    "commands": [
      {
        "key": "*",
        "text": "Next",
        "transitions": [
          {
            "chance": 1,
            "stateId": "END-GAME",
            "dPoints": 0,
            "uPoints": 0,
            "pPoints": 0,
            "ePoints": 0
          }
        ]
      }
    ]
  }
]
